In [27]:
import pandas as pd

In [28]:
list_var = ['a','b','c','d']

In [29]:
type(list_var)

list

In [30]:
series_var = pd.Series(list_var, index =[1,2,3,4]) #1,2,3,4 = index

In [31]:
series_var

1    a
2    b
3    c
4    d
dtype: object

In [32]:
type(series_var)

pandas.core.series.Series

In [33]:
series_var2 = pd.Series({1:'a',  2:'b' , 3:'c', 4:'d'})

In [34]:
series_var2

1    a
2    b
3    c
4    d
dtype: object

In [35]:
series_var2[1]

'a'

----------------

# DataFrame

- DataFrame = series + series + series + .....

In [36]:
df = pd.DataFrame( {'name' :['yejin', 'jiwon' , 'sanghyeon'],  
                    'age' : ['25', '22' ,'32'],  
                    'gender' : ['F','F','M']})

In [37]:
df  #세로줄은 시리즈

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [38]:
df['name']

0        yejin
1        jiwon
2    sanghyeon
Name: name, dtype: object

In [39]:
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [40]:
df.info() #Dtype 종류 3가지 int 정수  flort 실수 object(문자가 하나라도 있으면 오브젝트 )

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      object
 2   gender  3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [41]:
df.head() #head 앞에서 부터 불어와라

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [42]:
df.tail() # tail e뒤에서 부터 가져와라

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [43]:
df.head(1)

    name age gender
0  yejin  25      F

In [44]:
df.tail(1)

        name age gender
2  sanghyeon  32      M

In [45]:
df['age'] = df['age'].astype(int)  #type바꾸는거 astype

In [46]:
df['age']

0    25
1    22
2    32
Name: age, dtype: int32

In [47]:
df['age'].sum()

79

In [48]:
df['age'].mean() #평균

26.333333333333332

In [49]:
df['age'].median()  #중앙값

25.0

In [50]:
print(df['age'].max()) #최대
print(df['age'].min()) #최소
print(df['age'].std()) #표준편차 
print(df['age'].var()) #분산

32
22
5.131601439446884
26.333333333333332

In [51]:
df.describe()

             age
count   3.000000
mean   26.333333
std     5.131601
min    22.000000
25%    23.500000
50%    25.000000
75%    28.500000
max    32.000000

In [52]:
df[df['name'] == 'jiwon']

    name  age gender
1  jiwon   22      F

In [53]:
df[(df['age']>20) & (df['gender'] =='1')]

Empty DataFrame
Columns: [name, age, gender]
Index: []

. and 둘다 t 이면 t  
. or 둘중에 하나가 t 이면 t

# loc, iloc

In [54]:
loc index기준 
iloc 숫자 기준

SyntaxError: invalid syntax (1582452891.py, line 1)

In [ ]:
df = pd.DataFrame( {'name' :['yejin', 'jiwon' , 'sanghyeon'],  
                    'age' : ['25', '22' ,'32'],  
                    'gender' : [1,1,0]} , index =['a','b','c']  )

In [ ]:
df.loc['a']

In [ ]:
df.iloc[0]['age']

In [ ]:
df.iloc[0].age

In [ ]:
df.iloc[0].name

# DataFrame 합치기

In [55]:
df1 = pd.DataFrame({'A' :[1,2,3,4] , 
                    'B' :[5,6,7,8] ,
                    'C' :[9,10,11,12]})
df2 = pd.DataFrame({'A' :[13,14,15,16] , 
                    'B' :[17,18,19,20] ,
                    'C' :[21,22,23,24]})

In [56]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [57]:
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [58]:
df3 = pd.concat([df1,df2])

In [59]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [60]:
df3.reset_index()

   index   A   B   C
0      0   1   5   9
1      1   2   6  10
2      2   3   7  11
3      3   4   8  12
4      0  13  17  21
5      1  14  18  22
6      2  15  19  23
7      3  16  20  24

In [61]:
df3 = df3.reset_index(drop=True) # 세로로ㅗ 붙이기

In [62]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [63]:
pd.concat([df1,df2], axis=1 ) # 가로로 부팅기 #가로 행 세로 열

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

In [64]:
df1['D'] = [13,14,15,16]

In [65]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [66]:
df1.drop('A', axis=1 , inplace = True)

In [67]:
df1

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

# Groupby

In [70]:
data = { 'Company' : ['GOOG' ,'GOOG' , 'MSFT','MSFT' , 'FB' ,'FB'] ,
        'Person' : [ 'Sam' , 'Charlie', 'Amy', 'Veanessa', 'Carl' ,'Sarah'],  
        'Sales' : [200,120, 340, 124,243,350]}

In [71]:
df = pd.DataFrame(data)

In [72]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [74]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

## 회사별 sales값의 평균  quiz

In [88]:
print(df[df['Company'] == 'GOOG']['Sales'].mean())
print(df[df['Company'] == 'MSFT']['Sales'].mean())
print(df[df['Company'] == 'FB']['Sales'].mean())

160.0
232.0
296.5

In [91]:
for com in df['Company'].unique():
    print(com)

GOOG
MSFT
FB

In [94]:
df.groupby('Company')['Sales'].mean() # 더 쉬운 방법

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [97]:
df.columns  #columns 명은 복붙 하세요 임의로 설정이기에 타자 치다가 틀리면 오류남

Index(['Company', 'Person', 'Sales'], dtype='object')

In [98]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [99]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [100]:
df.groupby(['Company','Person']).min()

                  Sales
Company Person
FB      Carl        243
        Sarah       350
GOOG    Charlie     120
        Sam         200
MSFT    Amy         340
        Veanessa    124

In [101]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [102]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

- 내가 만든 오답

In [76]:
df['Sales'].mean()

229.5

In [80]:
df((df['Company'])and['Sales'].mean())

AttributeError: 'Series' object has no attribute 'value'

----

In [113]:
df = pd.DataFrame({'수학점수' : [65,80,60,80],
                   '과학점수' : [50,75,60,80],
                   '내신등급' : [3,1,2,1]})

In [114]:
df

   수학점수  과학점수  내신등급
0    65    50     3
1    80    75     1
2    60    60     2
3    80    80     1

In [115]:
df.sort_values(by ='수학점수')

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
1    80    75     1
3    80    80     1

In [120]:
df.sort_values(by='수학점수', ascending = False ) # false  오름차순 true 내림차순 ascending 정렬

   수학점수  과학점수  내신등급
1    80    75     1
3    80    80     1
0    65    50     3
2    60    60     2

In [121]:
df.sort_values(by=['수학점수','과학점수'], ascending = [False, True])  #수학점수 올름차순 과학점수 내림차순 어센딩 정렬(ascending)

   수학점수  과학점수  내신등급
1    80    75     1
3    80    80     1
0    65    50     3
2    60    60     2

In [122]:
df.sort_values(by=['수학점수','과학점수'], ascending = [True , False])

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
3    80    80     1
1    80    75     1